     10 IDN-REC-RUL PIC S9(9) USAGE COMP.
     10 CDE-REC-RUL-TYP PIC X(6).
     10 IND-AGGRT-RSLT  PIC X(1).
     10 IND-REC-RUL-ACTV  PIC X(1).
     10 NUM-RUL-TOLRNC PIC S9(10)V9(8) USAGE COMP-3.
     10 CDE-PRD-TYP    PIC X(3).
     10 NUM-RUL-PRTY   PIC S9(4) USAGE COMP.
     10 IDN-FILLER   PIC X(103).

