  05 WS-TEMP-X PIC X(100).
  05 WS-TEMP-9 PIC S9(9) COMP.
  05 WS-TEMP-9C3 PIC S9(9) COMP-3.
  05 WS-TEMP-9C PIC 9(4) COMP.
  05 WS-TEMP-X PIC X(100).
  05 WS-TEMP-9 PIC S9(9) COMP.
  05 WS-TEMP-9C3 PIC S9(9) COMP-3.
  05 WS-TEMP-9C PIC 9(4) COMP.
  05 WS-TEMP-A PIC A(50).
